Autodesk.Revit.DB.CheckoutStatus
Indicates the ownership status of an element
Since:
2012

Autodesk.Revit.DB.CheckoutStatus.NotOwned
The element is not owned by any user.

Autodesk.Revit.DB.CheckoutStatus.OwnedByOtherUser
The element is owned by some user other than the current user.

Autodesk.Revit.DB.CheckoutStatus.OwnedByCurrentUser
The element is owned by the current user.